# -*- eval: (add-hook 'after-save-hook (lambda () (when (eq major-mode 'org-mode) (org-beamer-export-to-latex))) nil t)
#+OPTIONS: H:2 toc:t num:t
#+LANGUAGE: en
#+SELECT_TAGS: export
#+EXCLUDE_TAGS: noexport

#+LaTeX_CLASS: mbeamer
#+PROPERTY: header-args:sage :tolatex lambda obj: r'(%s)' % latex(obj) :results raw

#+TITLE: FPLLL
#+SUBTITLE: fp\textbf{Y}lll
#+AUTHOR: Martin R. Albrecht
#+EMAIL: martin.albrecht@royalholloway.ac.uk
#+DATE: 2017/07/06
#+STARTUP: beamer indent
#+BIBLIOGRAPHY: local.bib,abbrev3.bib,crypto_crossref.bib,rfc.bib,jacm.bib
#+LATEX_HEADER: \lstdefinelanguage{Cython}[]{Python}{morekeywords={True,False,sage,cdef,new,namespace,extern,cppclass,cimport,IF,ELSE,ctypedef,union,nogil,with},sensitive=true}
#+LATEX_HEADER: \lstset{basicstyle=\tt\scriptsize\relax}

** Multicore

Let’s get to work: we create a pool of workers and kick off the computation:

#+BEGIN_SRC python
pool = Pool(workers)
A = pool.map(LLL.reduction, A)
#+END_SRC

#+RESULTS:

Finally, we output the minimal norm found:

#+BEGIN_SRC python
min([A_[0].norm() for A_ in A])
#+END_SRC

#+RESULTS:
7194.54515588

** Sage Integration
:PROPERTIES:
:BEAMER_OPT: allowframebreaks
:END:

*fpylll* integrates reasonably nicely with [[http://sagemath.org][Sage]]: converting back and forth between data types is seamless. For example:

#+BEGIN_SRC sage
sage: A = random_matrix(ZZ, 10, 10)
sage: from fpylll import IntegerMatrix, LLL
sage: B = IntegerMatrix.from_matrix(A)
sage: LLL.reduction(B)
sage: B.to_matrix(A)[0]
#+END_SRC

#+RESULTS:
(-2, 1, 0, -1, 0, 0, 1, -2, 0, 0)

#+BEAMER: \framebreak

In fact, when installed inside Sage, element access for =IntegerMatrix= accepts and returns =sage.rings.integer.Integer= directly, instead of Python integers.

#+BEGIN_SRC sage
sage: type(B[0,0])
<type 'sage.rings.integer.Integer'>
#+END_SRC

